IRP/src/Enums/MaterialsCostWriteOff/MaterialsCostWriteOff.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MaterialsCostWriteOff</name>
  <enumValues>
    <name>IncludeToWorkCost</name>
  </enumValues>
  <enumValues>
    <name>NotInclude</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Enums/ProcurementMethods/ProcurementMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ProcurementMethods</name>
 <enumValues>
  <name>Stock</name>
 </enumValues>
 <enumValues>
  <name>Purchase</name>
 </enumValues>
 <enumValues>
  <name>NoReserve</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/BillOfMaterials/BillOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>BillOfMaterials</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </attributes>
 <attributes>
  <name>Active</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BusinessUnit</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.BillOfMaterialsTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ExtraCostAmountByRatio</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>ExtraCostTaxAmountByRatio</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>DurationOfProduction</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
    <scale>2</scale>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ExtraDirectCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>ExtraDirectCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Content</name>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>BillOfMaterials</name>
   <type>
    <types>CatalogRef.BillOfMaterials</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/DocWorkOrderServer/Module.bsl
#Region FORM

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	If Form.Parameters.Key.IsEmpty() Then
		SetGroupItemsList(Object, Form);
		DocumentsClientServer.ChangeTitleGroupTitle(Object, Form);
	EndIf;
	RowIDInfoServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	ViewServer_V2.OnCreateAtServer(Object, Form, "ItemList");
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	Form.Taxes_CreateFormControls();
	RowIDInfoServer.AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters);
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	If Not Form.GroupItems.Count() Then
		SetGroupItemsList(Object, Form);
	EndIf;
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	Form.Taxes_CreateFormControls();
	RowIDInfoServer.OnReadAtServer(Object, Form, CurrentObject);
EndProcedure

#EndRegion

#Region GroupTitle

Procedure SetGroupItemsList(Object, Form)
	AttributesArray = New Array();
	AttributesArray.Add("Company");
	AttributesArray.Add("Partner");
	AttributesArray.Add("LegalName");
	AttributesArray.Add("Agreement");	
	AttributesArray.Add("Status");
	DocumentsServer.DeleteUnavailableTitleItemNames(AttributesArray);
	For Each Attr In AttributesArray Do
		Form.GroupItems.Add(Attr, ?(ValueIsFilled(Form.Items[Attr].Title), Form.Items[Attr].Title,
			Object.Ref.Metadata().Attributes[Attr].Synonym + ":" + Chars.NBSp));
	EndDo;
EndProcedure

#EndRegion

#Region ListFormEvents

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region ChoiceFormEvents

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

Function GetMaterialsForWork(BillOfMaterialsRef, UUID) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	BillOfMaterialsContent.Item AS Item,
	|	BillOfMaterialsContent.ItemKey AS ItemKey,
	|	BillOfMaterialsContent.Unit AS Unit,
	|	BillOfMaterialsContent.Quantity AS Quantity,
	|	BillOfMaterialsContent.Ref.BusinessUnit.MaterialStore AS Store,
	|	VALUE(Enum.MaterialsCostWriteOff.IncludeToWorkCost) AS CostWriteOff,
	|	VALUE(Enum.ProcurementMethods.Stock) AS ProcurementMethod
	|FROM
	|	Catalog.BillOfMaterials.Content AS BillOfMaterialsContent
	|WHERE
	|	BillOfMaterialsContent.Ref = &Ref";
	Query.SetParameter("Ref", BillOfMaterialsRef);
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
//	BillOfMaterials_UUID = String(Object.BillOfMaterials.UUID());
//	For Each Row In QueryResults[1].Unload() Do
//		RowUniqueID = String(Row.ItemKeyBOM.UUID()) + "-" + BillOfMaterials_UUID;
	
	Address = PutToTempStorage(QueryTable, UUID);
	GroupColumns = "Item, ItemKey, Unit, Store, CostWriteOff, ProcurementMethod";
	
	Return New Structure("Address, GroupColumns", Address, GroupColumns);
EndFunction
